In [1]:
import pandas as pd
from pandas import DataFrame

## dataframe 생성

In [2]:
data = {
    "city" : ["aaa", "bbb", "ccc", "ddd"],
    "name" : ["김", "이", "박", "최"],
    "job" : ["학생", '경찰', '소방관', '거지'],
    "age" : [11, 22, 33, 44]
}

df = DataFrame(data)
df

  city name  job  age
0  aaa    김   학생   11
1  bbb    이   경찰   22
2  ccc    박  소방관   33
3  ddd    최   거지   44

In [3]:
df['name'] #df의 name만 출력

0    김
1    이
2    박
3    최
Name: name, dtype: object

In [4]:
df.name

0    김
1    이
2    박
3    최
Name: name, dtype: object

In [5]:
df.loc[2] #3번째 줄 데이터

city    ccc
name      박
job     소방관
age      33
Name: 2, dtype: object

In [6]:
df.name.loc[2] #이름 컬럼의 3번째 데이터

'박'

In [7]:
df=DataFrame(data, index=[14,1,3,2]) #index를 지정하여 생성
df

   city name  job  age
14  aaa    김   학생   11
1   bbb    이   경찰   22
3   ccc    박  소방관   33
2   ddd    최   거지   44

In [8]:
df.loc[:14] #인덱스값이 14

   city name job  age
14  aaa    김  학생   11

In [9]:
df.iloc[:3] #첫 행부터 3개의 행까지

   city name  job  age
14  aaa    김   학생   11
1   bbb    이   경찰   22
3   ccc    박  소방관   33

iloc - 원하는 행까지. 처음부터 지정한 행까지
loc - 인덱스를 읽어옴.

In [10]:
df.iloc[:14] #

   city name  job  age
14  aaa    김   학생   11
1   bbb    이   경찰   22
3   ccc    박  소방관   33
2   ddd    최   거지   44

In [11]:
df.head(3) #0,1,2 행까지 추출

   city name  job  age
14  aaa    김   학생   11
1   bbb    이   경찰   22
3   ccc    박  소방관   33

In [12]:
df.tail(2) #끝에서 2행까지 추출

  city name  job  age
3  ccc    박  소방관   33
2  ddd    최   거지   44

In [14]:
df=pd.DataFrame([[1,2,3],[4,5,6]])
print(df)

   0  1  2
0  1  2  3
1  4  5  6

In [18]:
df=pd.DataFrame([[1,2,3],[4,5,6]])
df.columns=['aa','bb','cc']
df.index=['x', 'y']
print(df)

   aa  bb  cc
x   1   2   3
y   4   5   6

In [20]:
df=pd.DataFrame([[1,2,3],[4,5,6]], columns=['aa','bb','cc'], index=['x', 'y'])
print(df)

   aa  bb  cc
x   1   2   3
y   4   5   6

In [21]:
df=pd.DataFrame([[1,2,3],[4,5,6]], columns=['aa','bb','cc'], index=['x', 'y'])
df=df.append(df.sum(), ignore_index=True)
df.index=['x', 'y', 'z']
print(df)

   aa  bb  cc
x   1   2   3
y   4   5   6
z   5   7   9

# pandas 실습(1)

In [28]:
df=pd.DataFrame([[1000,2000,3000,5000], [600,150,800,900]], columns=[1,2,3,4,], index=['a', 'b'])
df=df.append(df.sum(), ignore_index=True)
df.index=['a', 'b', 'sum']
df

        1     2     3     4
a    1000  2000  3000  5000
b     600   150   800   900
sum  1600  2150  3800  5900

In [30]:
df=pd.DataFrame([[2015, '한국', 200], [2016, '한국', 250], [2016, '미국', 450], [2017, '한국', 300], [2017, '미국', 500]], 
                 columns=['연도', '지사', '고객수'], 
                 index=['[1]', '[2]', '[3]', '[4]', '[5]'])
df

       연도  지사  고객수
[1]  2015  한국  200
[2]  2016  한국  250
[3]  2016  미국  450
[4]  2017  한국  300
[5]  2017  미국  500

# 1. excel file : 읽고 쓰기

In [31]:
df=pd.read_excel('kbo_rank.xlsx')
df

,순위,팀명,경기,승,패,무,승률,게임차,최근10경기,연속,홈,방문
0,1,두산,104,68,36,0,0.654,0.0,5승0무5패,2패,36-0-13,32-0-23
1,2,SK,103,59,43,1,0.578,8.0,6승0무4패,2승,31-0-18,2028-01-25 00:00:00
2,3,한화,106,59,47,0,0.557,10.0,4승0무6패,2패,32-0-21,27-0-26
3,4,LG,107,53,53,1,0.500,16.0,2승0무8패,5패,1931-01-22 00:00:00,22-0-31
4,5,넥센,109,53,56,0,0.486,17.5,5승0무5패,3승,24-0-32,29-0-24
5,6,삼성,107,50,54,3,0.481,18.0,6승1무3패,1승,2024-02-25 00:00:00,2026-01-29 00:00:00
6,7,KIA,102,48,54,0,0.471,19.0,5승0무5패,2승,31-0-23,17-0-31
7,8,롯데,103,45,56,2,0.446,21.5,6승0무4패,1패,24-0-29,2021-02-27 00:00:00
8,9,KT,104,43,59,2,0.422,24.0,4승0무6패,4패,2022-02-28 00:00:00,21-0-31
9,10,NC,107,43,63,1,0.406,26.0,6승1무3패,2승,23-0-32,2020-01-31 00:00:00

In [33]:
df = pd.read_excel('management.xlsx')
df

        이름     시급  출근시간  퇴근시간  아이스크림 생산
0  nayoung   8000     6    15       600
1      kim  15000     8    12      1800
2   meyaon  15000     9    16       900
3   degrea   2000    10    18       400

In [37]:
df['근무시간'] = df['퇴근시간']-df['출근시간']
df['시간당 아이스크림'] = df['아이스크림 생산'] - df['근무시간']

In [38]:
df

        이름     시급  출근시간  퇴근시간  아이스크림 생산  근무시간  시간당 아이스크림
0  nayoung   8000     6    15       600     9        591
1      kim  15000     8    12      1800     4       1796
2   meyaon  15000     9    16       900     7        893
3   degrea   2000    10    18       400     8        392

In [41]:
df=df.sort_values(by=['시간당 아이스크림'], ascending=False)
df

        이름     시급  출근시간  퇴근시간  아이스크림 생산  근무시간  시간당 아이스크림
1      kim  15000     8    12      1800     4       1796
2   meyaon  15000     9    16       900     7        893
0  nayoung   8000     6    15       600     9        591
3   degrea   2000    10    18       400     8        392

In [43]:
df=df.sort_values(by='근무시간', ascending=False)
df
df.to_excel('최종.xlsx')

In [46]:
a=Series([3,2,3,4,1])
print(a)

0    3
1    2
2    3
3    4
4    1
dtype: int64

In [47]:
value = [2.2, 3, 1.1, 5, 1]
index = ['c', 'a', 'b', 'd', 'e']
a = Series(value, index)
print(a)
# 숫자 인덱스와 지정한 인덱스 모두 사용가능!!
print(a[1])
print(a['b'])

c    2.2
a    3.0
b    1.1
d    5.0
e    1.0
dtype: float64
3.0
1.1

In [48]:
import re

## 문제

In [52]:
df = pd.read_csv('LEC_03_data.csv')
df

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [54]:
df.iloc[:3]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer

In [56]:
df.loc[3:4]

   Name Country  Age        Job
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

In [57]:
df.iloc[4:]

    Name Country  Age        Job
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

## 문제

In [61]:
df.loc[0]

Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

In [69]:
df.loc[[0, 3]] #0행 3행 데이터

   Name Country  Age      Job
0  John     USA   31  Student
3  Sato   Japan   40     Chef

In [70]:
df.loc[[1, 2, 5]]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
5  Smith     USA   55        CEO

## 문제

In [72]:
df1 = pd.read_csv('LEC_03_data.csv')
df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [73]:
df1.Country

0       USA
1    France
2     Korea
3     Japan
4     Korea
5       USA
Name: Country, dtype: object

In [81]:
df1[['Name', 'Country']]

    Name Country
0   John     USA
1  Sabre  France
2    Kim   Korea
3   Sato   Japan
4    Lee   Korea
5  Smith     USA

In [82]:
df1[['Name', 'Country', 'Job']]

    Name Country        Job
0   John     USA    Student
1  Sabre  France     Lawyer
2    Kim   Korea  Developer
3   Sato   Japan       Chef
4    Lee   Korea  Professor
5  Smith     USA        CEO

In [90]:
df2=pd.read_csv('LEC_03_data.csv', header=None)
df2

       0        1    2          3
0   Name  Country  Age        Job
1   John      USA   31    Student
2  Sabre   France   33     Lawyer
3    Kim    Korea   28  Developer
4   Sato    Japan   40       Chef
5    Lee    Korea   36  Professor
6  Smith      USA   55        CEO

## 문제

In [ ]:
#df2.drop([0])

In [93]:
df2.iloc[:, 1:3]

         1    2
0  Country  Age
1      USA   31
2   France   33
3    Korea   28
4    Japan   40
5    Korea   36
6      USA   55

In [88]:
df2[[2,3]].iloc[:4]

     2          3
0  Age        Job
1   31    Student
2   33     Lawyer
3   28  Developer

In [91]:
df2[[0,2,3]]

       0    2          3
0   Name  Age        Job
1   John   31    Student
2  Sabre   33     Lawyer
3    Kim   28  Developer
4   Sato   40       Chef
5    Lee   36  Professor
6  Smith   55        CEO

In [92]:
df2[[1,3]].loc[[1,3]]

       1          3
1    USA    Student
3  Korea  Developer

In [94]:
df2.iloc[:, 1:3]

         1    2
0  Country  Age
1      USA   31
2   France   33
3    Korea   28
4    Japan   40
5    Korea   36
6      USA   55

In [95]:
df2.iloc[1:4, 2:]

    2          3
1  31    Student
2  33     Lawyer
3  28  Developer

In [96]:
# 모든 행 0,2,3열
df2.iloc[:, [0,2,3]]

       0    2          3
0   Name  Age        Job
1   John   31    Student
2  Sabre   33     Lawyer
3    Kim   28  Developer
4   Sato   40       Chef
5    Lee   36  Professor
6  Smith   55        CEO

In [97]:
#1행 3행, 1열 3열
df2.iloc[[1,3], [1,3]]

       1          3
1    USA    Student
3  Korea  Developer

## 문제

In [99]:
df1

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [110]:
is_korea = df['Country'] == 'Korea'
korea = df[is_korea]
korea

  Name Country  Age        Job
2  Kim   Korea   28  Developer
4  Lee   Korea   36  Professor

In [119]:
print(df[df.Age > 30])

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

# 문제

In [123]:
df[df['Country'].isin(['Korea'])]

  Name Country  Age        Job
2  Kim   Korea   28  Developer
4  Lee   Korea   36  Professor

In [127]:
not_korea = df['Country'] != 'Korea'
df[not_korea]

    Name Country  Age      Job
0   John     USA   31  Student
1  Sabre  France   33   Lawyer
3   Sato   Japan   40     Chef
5  Smith     USA   55      CEO

In [128]:
df[df.Age > 33]

    Name Country  Age        Job
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [132]:
df[df.Country != 'USA' and df.Age >= 33]

SyntaxError: invalid syntax (<ipython-input-132-fe16e05fb50e>, line 1)

In [133]:
df[df.Country != 'Korea']

    Name Country  Age      Job
0   John     USA   31  Student
1  Sabre  France   33   Lawyer
3   Sato   Japan   40     Chef
5  Smith     USA   55      CEO

In [134]:
df[df.Age >= 33]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

In [135]:
df[(df.Country != 'USA') & (df.Age >= 33)]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor

In [136]:
df[(df.Country == 'Korea') | (df.Job == 'Chef')]

   Name Country  Age        Job
2   Kim   Korea   28  Developer
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

In [137]:
df[(df.Age>30) & (df.Job == 'CEO')]

    Name Country  Age  Job
5  Smith     USA   55  CEO

# 문제

In [138]:
df.filter(items = ['Name', 'Country'])

    Name Country
0   John     USA
1  Sabre  France
2    Kim   Korea
3   Sato   Japan
4    Lee   Korea
5  Smith     USA

In [139]:
df.filter(like='N') #N이 들어간

    Name
0   John
1  Sabre
2    Kim
3   Sato
4    Lee
5  Smith

In [144]:
df.filter(regex='J', axis=1)

         Job
0    Student
1     Lawyer
2  Developer
3       Chef
4  Professor
5        CEO

In [141]:
df.filter(like='A')

   Age
0   31
1   33
2   28
3   40
4   36
5   55

In [142]:
df.filter(regex='A')

   Age
0   31
1   33
2   28
3   40
4   36
5   55

# 5-3

## 실습 문제

In [146]:
from pandas import DataFrame

data = {'name' :['박대성', '백상훈', '이권수', '이우현'],
       'money':[5000, 2000000, 5000000, 80000000],
       'sex':['M', 'M', 'M', 'M']}

df = DataFrame(data)
print(df)

  name     money sex
0  박대성      5000   M
1  백상훈   2000000   M
2  이권수   5000000   M
3  이우현  80000000   M

In [148]:
df[(df.money > 10000)&(df.sex == 'M')]

  name     money sex
1  백상훈   2000000   M
2  이권수   5000000   M
3  이우현  80000000   M

In [156]:
data = {
    'weight':[91, 85, 100, 75, 43, 38],
    'height':[180, 173, 190, 170, 163, 152],
    'gender':['male', 'female', 'male', 'female', 'female',' male']
    }

df = DataFrame(data)
df

   weight  height  gender
0      91     180    male
1      85     173  female
2     100     190    male
3      75     170  female
4      43     163  female
5      38     152    male

In [157]:
df[df.weight>80]

   weight  height  gender
0      91     180    male
1      85     173  female
2     100     190    male

In [158]:
df.sort_values(by=['weight'])

   weight  height  gender
5      38     152    male
4      43     163  female
3      75     170  female
1      85     173  female
0      91     180    male
2     100     190    male

In [159]:
df.sort_values(by=['height'], ascending=False)

   weight  height  gender
2     100     190    male
0      91     180    male
1      85     173  female
3      75     170  female
4      43     163  female
5      38     152    male

In [161]:
df_grouped = df.groupby('gender')
df_grouped_mean = df_grouped.mean()
df_grouped_mean

           weight      height
gender
 male   38.000000  152.000000
female  67.666667  168.666667
male    95.500000  185.000000

In [163]:
for key, group in df_grouped:
    print(key) # 그룹을 묶을 때 쓴 키
    print(group) # 키로 묶인 그룹

 male
   weight  height gender
5      38     152   male
female
   weight  height  gender
1      85     173  female
3      75     170  female
4      43     163  female
male
   weight  height gender
0      91     180   male
2     100     190   male

In [164]:
df = pd.read_csv('commerce.csv')
df

,collect_day,good_id,pum_id,pum_name,good_name,sales_price,discount_price,benifit
0,2019-03-01,1000456210,I053020,스케치북,묶음상품 )스케치북 4절(220g 17매)x9개 드로북 드로잉북 그림스케치북 스케치...,68700,NaN,NaN
1,2019-03-01,1000461046,L012010,면도기,[쉬크] 쉬크 하이드로 5 면도기 가정용면도기 남자용면도기 가정용남자면도기 면도기 ...,21850,NaN,NaN
2,2019-03-01,1000469476,C021030,운동화,(옵션 : 265) 아디다스 울트라부스트 런닝화(BB6168) 커플운동화 여성운동화...,219190,NaN,NaN
3,2019-03-01,1000469524,C013010,점퍼,롱야상 웰론 롱패딩 AM 롱패딩 롱야상 후드패딩 패딩점퍼 롱 패딩,137620,NaN,NaN
4,2019-03-01,1000472413,C013010,점퍼,롱야상 롱후드 MA1 BW 롱패딩 롱야상 후드패딩 패딩점퍼 롱 패딩,112980,NaN,NaN
...,...,...,...,...,...,...,...,...
199619,2019-03-01,895857985,A018080,설탕,[삼양]삼양 큐원 갈색 설탕 1kg,2200,2200.0,0.0
199620,2019-03-01,895858087,L012090,기초화장품,[존슨&존슨]존슨앤존슨 베드타임 로션 500ML,15900,15900.0,0.0
199621,2019-03-01,895864805,A011090,국수,[오뚜기]오뚜기 옛날국수 (소면/1.5KG),4290,4090.0,-200.0
199622,2019-03-01,895864870,A019110,드레싱,[청정원]청정원 참깨 흑임자 드레싱 (300g),3790,3790.0,0.0
199623,2019-03-01,895864871,A019110,드레싱,[청정원]청정원 프렌치 발사믹 드레싱 325g,3790,3790.0,0.0

In [166]:
top = df[df.sales_price > 10000]
top = top.sort_values(by=['sales_price'])

top.head()

,collect_day,good_id,pum_id,pum_name,good_name,sales_price,discount_price,benifit
57889,2019-03-01,1573217200,A019040,소금,맛소금(중간입자 백설 5K)/소금 맛소금 고운소금,10010,NaN,NaN
102979,2019-03-01,202616587,L012090,기초화장품,쟝블랑 옴므 캐비어 릴렉스 2종세트 스킨로션세트 남,10010,NaN,NaN
104129,2019-03-01,2034790301,L012090,기초화장품,(과일나라) 첫물녹차 모이스트 폼클렌징 180g,10010,NaN,NaN
99999,2019-03-01,1900785338,E061040,부엌용세제,천연주방세제 연 500ml 천연주방세제 연 500ml/친환경,10030,NaN,NaN
140364,2019-03-01,430746708,E061060,살충제,컴배트 파워(작은바퀴12개입) 바퀴벌레약 벌레방지 바,10030,NaN,NaN

In [167]:
df_grouped = df.groupby('pum_name')

In [169]:
track = df_grouped.get_group('운동복')
track.head()

,collect_day,good_id,pum_id,pum_name,good_name,sales_price,discount_price,benifit
667,2019-03-01,1004607951,C013050,운동복,(색상 : 블루 | 사이즈 : M) 여성 애슬레저 히든포켓 운동복 하의 요가바지 여...,43750,NaN,NaN
674,2019-03-01,1004634761,C013050,운동복,(색상 : 블루 | 사이즈 : L) 여성 애슬레저 히든포켓 운동복 하의 여성트레이닝...,43750,NaN,NaN
680,2019-03-01,1004638823,C013050,운동복,(색상 : 다크그레이 | 사이즈 : M) 여성 애슬레저 히든포켓 운동복 하의 요가팬...,43750,NaN,NaN
684,2019-03-01,1004662846,C013050,운동복,(색상 : 다크그레이 | 사이즈 : L) 여성 애슬레저 히든포켓 운동복 하의 여자트...,43750,NaN,NaN
1426,2019-03-01,1009875736,C013050,운동복,(사이즈 선택 : 100(XL)) DYT 오픈져지(GLS-642) 운동복 스포츠의류...,82960,NaN,NaN

In [173]:
track_min = track.min()
track_min

collect_day                                              2019-03-01
good_id                                                       53044
pum_id                                                      C013050
pum_name                                                        운동복
good_name         (Color : 그레이) SET057-원버튼 베스트 숏팬츠 쓰리세트 운동복 트레이닝...
sales_price                                                    4350
discount_price                                                62560
benifit                                                      -16440
dtype: object

In [174]:
track_max = track.max()
track_max

collect_day                      2019-03-01
good_id                          2144415987
pum_id                              C013050
pum_name                                운동복
good_name         후드티셔츠 레깅스 팬츠 세트 트레이닝복 운동복
sales_price                          389920
discount_price                        62560
benifit                              -16440
dtype: object

In [175]:
df_filtered = df[df['sales_price']<10000]
df_sorted = df_filtered.sort_values('sales_price', ascending=False) # 판매가격이 10000원 이하인 제품중에 싼 순으로 정렬
print(df_sorted.head(5))

       collect_day     good_id   pum_id pum_name  \
188499  2019-03-01   898222120  A019050       간장
159936  2019-03-01   729126189  E061020    섬유유연제
185128  2019-03-01   989080907  L012040       치약
26876   2019-03-01   132440935  A019050       간장
52561   2019-03-01  1548850968  A017280        김

                                  good_name  sales_price  discount_price  \
188499          청정원 양조진간장 진한맛 플러스(840ML*3입)         9990          9990.0
159936  [무료배송] LG 샤프란 코튼앤크림 섬유유연제 3100 세탁용품         9990             NaN
185128          [LG]LG)리치컴플리트치약(오리지널)120G*3         9990          9990.0
26876                        샘표 국산콩간장 930ml         9990          9500.0
52561                        예맛_햇_생곱창돌김_50매         9990          9990.0

        benifit
188499      0.0
159936      NaN
185128      0.0
26876    -490.0
52561       0.0

In [176]:
grouped_by_category = df.groupby('pum_name')
running_suit = grouped_by_category.get_group('운동복')
print(running_suit.min())
print('------------------')
print(running_suit.max())

collect_day                                              2019-03-01
good_id                                                       53044
pum_id                                                      C013050
pum_name                                                        운동복
good_name         (Color : 그레이) SET057-원버튼 베스트 숏팬츠 쓰리세트 운동복 트레이닝...
sales_price                                                    4350
discount_price                                                62560
benifit                                                      -16440
dtype: object
------------------
collect_day                      2019-03-01
good_id                          2144415987
pum_id                              C013050
pum_name                                운동복
good_name         후드티셔츠 레깅스 팬츠 세트 트레이닝복 운동복
sales_price                          389920
discount_price                        62560
benifit                              -16440
dtype: object

# BeautifulSoup 라이브러리

In [178]:
import requests
from bs4 import BeautifulSoup
# 1) requests 라이브러리를 활용한 HTML 페이지 요청
# 1-1) res 객체에 HTML데이터가 저장되고, res.content로 데이터를 추출할 수 있음
res = requests.get('http://v.media.daum.net/v/20170615203441266')

# print(res.content)
# 2) HTML 페이지 파싱 BeautifulSoup(HTML데이터, 파싱방법)
# 2-1) BeautifulSoup 파싱방법
soup = BeautifulSoup(res.content, 'html.parser')

# 3) 필요한 데이터 검색
title = soup.find('title')

# 4) 필요한 데이터 추출
print(title.get_text())

잔금대출에도 DTI 규제 적용 검토

In [180]:
html = "<html>\
            <body>\
                <h1 id='title'>[1]크롤링이란?</h1>\
                <p class='cssstyle'>웹페이지에서 필요한 데이터를 추출하는 것</p>\
                <p id='body' align='center'>파이썬을 중심으로 다양한 웹크롤링 기술 발달</p>\
            </body>\
        </html>"

soup = BeautifulSoup(html, "html.parser")

# 태그로 검색 방법
title_data = soup.find('h1')

print(title_data)
print(title_data.string)
print(title_data.get_text())

<h1 id="title">[1]크롤링이란?</h1>
[1]크롤링이란?
[1]크롤링이란?

# 코로나

In [184]:
import pandas as pd
import numpy as np

In [185]:
url = 'http://www.seoul.go.kr/coronaV/coronaStatus.do'
url

'http://www.seoul.go.kr/coronaV/coronaStatus.do'

In [183]:
table = pd.read_html(url)
len(table)

6

In [187]:
table[0].T

                0
소계           1526
해외접촉관련        330
강서구요양시설관련      14
강남구사무실관련       24
강남구사무실K빌딩       5
관악구사무실관련       12
강남구역삼동모임       13
송파구교회관련         7
리치웨이관련        122
부천시쿠팡관련        24
강남역상동금융회사       9
이태원클럽관련       139
구로구콜센터관련       98
타 시·도확진자접촉자    53
기타            520
경로확인중         156

In [188]:
df=table[4]
df.shape

(1526, 7)

In [189]:
df.head()

     연번     환자    확진일   거주지 여행력         접촉력    조치사항
0  1526  13926  7.22.   송파구   -    송파구 교회관련   서울의료원
1  1525  13925  7.22.   송파구   -    송파구 교회관련   서울의료원
2  1524  13924  7.22.   강남구   -  타시도 확진자 접촉   보라매병원
3  1523  13921  7.22.  동대문구   -        확인 중  삼육서울병원
4  1522  13917  7.22.   강남구   -  타시도 확진자 접촉   원자력병원

In [191]:
last_day = df.loc[0, "확진일"]
last_day = last_day.replace('.', '_')
last_day

'7_22_'

In [192]:
file_name = f"seoul_covid_{last_day}.csv"
file_name

'seoul_covid_7_22_.csv'

In [193]:
df.to_csv(file_name, index=False)

In [194]:
pd.read_csv(file_name)

        연번     환자    확진일   거주지     여행력         접촉력         조치사항
0     1526  13926  7.22.   송파구       -    송파구 교회관련        서울의료원
1     1525  13925  7.22.   송파구       -    송파구 교회관련        서울의료원
2     1524  13924  7.22.   강남구       -  타시도 확진자 접촉        보라매병원
3     1523  13921  7.22.  동대문구       -        확인 중       삼육서울병원
4     1522  13917  7.22.   강남구       -  타시도 확진자 접촉        원자력병원
...    ...    ...    ...   ...     ...         ...          ...
1521     5      9  1.31.   성북구       -       #5 접촉    서울의료원(퇴원)
1522     4      7  1.30.   마포구  중국 우한시       해외 접촉    서울의료원(퇴원)
1523     3      6  1.30.   종로구       -       #3 접촉  서울대학교병원(퇴원)
1524     2      5  1.30.   중랑구  중국 우한시       해외 접촉    서울의료원(퇴원)
1525     1      2  1.24.   강서구  중국 우한시       해외 접촉  국립중앙의료원(퇴원)

[1526 rows x 7 columns]

In [196]:
df = df.sort_values(["연번"], ascending=False)

In [197]:
df.head()

     연번     환자    확진일   거주지 여행력         접촉력    조치사항
0  1526  13926  7.22.   송파구   -    송파구 교회관련   서울의료원
1  1525  13925  7.22.   송파구   -    송파구 교회관련   서울의료원
2  1524  13924  7.22.   강남구   -  타시도 확진자 접촉   보라매병원
3  1523  13921  7.22.  동대문구   -        확인 중  삼육서울병원
4  1522  13917  7.22.   강남구   -  타시도 확진자 접촉   원자력병원

In [198]:
df.tail()

      연번  환자    확진일  거주지     여행력    접촉력         조치사항
1521   5   9  1.31.  성북구       -  #5 접촉    서울의료원(퇴원)
1522   4   7  1.30.  마포구  중국 우한시  해외 접촉    서울의료원(퇴원)
1523   3   6  1.30.  종로구       -  #3 접촉  서울대학교병원(퇴원)
1524   2   5  1.30.  중랑구  중국 우한시  해외 접촉    서울의료원(퇴원)
1525   1   2  1.24.  강서구  중국 우한시  해외 접촉  국립중앙의료원(퇴원)

In [199]:
import webbrowser

url = 'www.naver.com'
webbrowser.open(url)

True

In [205]:
naver_search_url = 'http://search.naver.com/search.naver?query='
search_word = 'python'
url = naver_search_url + search_word

webbrowser.open_new(url)

True

In [206]:
google_url = 'www.google.com/#q='
search_word = 'python'
url = google_url + search_word

webbrowser.open_new(url)

True

In [207]:
urls = ['www.naver.com', 'www.daum.net', 'www.google.com']

for url in urls:
    webbrowser.open_new(url)

In [210]:
import webbrowser

google_url = 'www.google.com/#q='
search_words = ['python web scraping', 'python webbrowser']

for search_word in search_words:
    webbrowser.open_new(google_url + search_word)

In [212]:
import requests

r = requests.get('https://www.google.co.kr')
r

In [214]:
# 테스트용 html 코드
html = """<html><body><div><span>\
        <a href=http://www.naver.com>naver</a>\
        <a href=http://www.google.com>google</a>\
        <a href=http://www.daum.net>daum</a>\
        </span></div></body></html>"""

# BeautifulSoup를 이용해 HTML 소스를 파싱
soup = BeautifulSoup(html, 'lxml')
soup

In [215]:
print(soup.prettify())

<html>
 <body>
  <div>
   <span>
    <a href="http://www.naver.com">
     naver
    </a>
    <a href="http://www.google.com">
     google
    </a>
    <a href="http://www.daum.net">
     daum
    </a>
   </span>
  </div>
 </body>
</html>

In [218]:
soup.find('a') #a 태그 찾고 싶다, 하지만 처음 것만 출력

In [219]:
soup.find('a').get_text()

'naver'

In [220]:
soup.find_all('a') #hyperlink 잡은 것 다 출력

[<a href="http://www.naver.com">naver</a>,
 <a href="http://www.google.com">google</a>,
 <a href="http://www.daum.net">daum</a>]

In [221]:
site_names = soup.find_all('a')
for site_name in site_names:
    print(site_name.get_text())

naver
google
daum

In [223]:
from bs4 import BeautifulSoup

# 테스트용 HTML 코드
html2="""
<html>
<head>
    <title>작품과 작가 모음</title>
</head>
<body>
    <h1>책 정보</h1>
    <p id="book_title">토지</p>
    <p id='author'>박경리</p>
    <p id='book_title'>태백산맥</p>
    <p id='author'>조정래</p>
    <p id='book_title'>감옥으로부터의 사색</p>
    <p id='author'>신영복</p>
</body>
</html>
"""

soup2 = BeautifulSoup(html2, "lxml")

In [224]:
soup2.title

In [225]:
soup2.body

<body>
<h1>책 정보</h1>
<p id="book_title">토지</p>
<p id="author">박경리</p>
<p id="book_title">태백산맥</p>
<p id="author">조정래</p>
<p id="book_title">감옥으로부터의 사색</p>
<p id="author">신영복</p>
</body>

In [226]:
soup2.body.h1

In [227]:
soup2.find('p', {'id':'book_title'})

In [228]:
soup2.find('p', {"id":"author"})

In [229]:
soup2.find_all('p', {'id':'book_title'})

[<p id="book_title">토지</p>,
 <p id="book_title">태백산맥</p>,
 <p id="book_title">감옥으로부터의 사색</p>]

In [230]:
soup2.find_all('p', {'id':'author'})

In [ ]:
soup2 = BeautifulSoup(html2, "lxml")

book_titles = soup2.find_all('p', {"id":"book_title"})
authors = soup2.find_all('p', {"id":"author"})